Revit 2021.1 API
Entity Methods
The Entity type exposes the following members.
Methods
Name | Description
Clear(String)
 Resets the field to its default value.
Clear(Field)
 Resets the field to its default value.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Get<FieldType>(String)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field)
 Retrieves the value of the field in the entity.
Get<FieldType>(String, DisplayUnitType) |  Obsolete.
 Retrieves the value of the field in the entity.
Get<FieldType>(String, ForgeTypeId)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field, DisplayUnitType) |  Obsolete.
 Retrieves the value of the field in the entity.
Get<FieldType>(Field, ForgeTypeId)
 Retrieves the value of the field in the entity.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Checks whether this Entity has a live Schema corresponding to it.
ReadAccessGranted
 Checks whether this Entity may be retrieved by the current add-in.
RecognizedField
 Checks whether a Field belongs to the same Schema as this Entity.
Set<FieldType>(String, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, DisplayUnitType) |  Obsolete.
 Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, ForgeTypeId)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, DisplayUnitType) |  Obsolete.
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, ForgeTypeId)
 Stores the value of the field in the entity.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
WriteAccessGranted
 Checks whether this Entity may be stored by the current add-in.
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace